DataProcessors/МедицинскоеСтрахование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>МедицинскоеСтрахование</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтраховаяКомпания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаСтрахования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияСтрахования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяУдержание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособУдержания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыУдержанияМедицинскогоСтрахованияСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Удержание</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Удержания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдерживатьЗаСотрудника</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдерживатьЗаРодственников</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрименяетсяЧастичноеУдержание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентЧастичногоУдержания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПрикреплениеСотрудников</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументПрикрепления</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПрикреплениеКПрограммамМедицинскогоСтрахования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрикреплениеКПрограммеСтрахованияОтложено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОткреплениеСотрудников</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОткрепления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОткрепления</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ОткреплениеОтПрограммМедицинскогоСтрахования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОткреплениеОтПрограммыСтрахованияОтложено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИзменениеПерсональныхДанныхСотрудников</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Застрахованный</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Застрахованный</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ОтложенноеМедицинскоеСтрахованиеСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ОтложенноеМедицинскоеСтрахованиеСотрудников</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтраховаяКомпания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РешенияОбОткрепленииСотрудниковМедицинскогоСтрахования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РешенияОбОткрепленииСотрудниковМедицинскогоСтрахования</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Откреплять</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОткрепления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдержатьОстаток</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОстатокУдержания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомпенсироватьСтоимостьПолиса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКомпенсации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтраховаяКомпания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПрограммыМедицинскогоСтрахованияСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПрограммыМедицинскогоСтрахованияСотрудников</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействуетДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтраховаяПремия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПрограммаСтрахования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрограммыМедицинскогоСтрахования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Родственник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РодственникиФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РасширенияПрограммМедицинскогоСтрахованияСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РасширенияПрограммМедицинскогоСтрахованияСотрудников</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействуетДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтраховаяПремия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РасширениеПрограммСтрахования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РасширенияПрограммМедицинскогоСтрахования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Родственник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РодственникиФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/МедицинскоеСтрахование/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗначенияДляЗаполнения = Новый Структура;
	ЗначенияДляЗаполнения.Вставить("Организация",	"Объект.Организация");
	ЗначенияДляЗаполнения.Вставить("Подразделение",	"Объект.Подразделение");
	ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтаФорма, ЗначенияДляЗаполнения);
	
	УстановитьДоступностьЭлементов(Элементы, УсловияСтрахованияСотрудников);
	
	СтандартнаяОбработка = Истина;
	ЗарплатаКадрыПереопределяемый.ЗаполнитьРеквизитОрганизацияПриОднофирменномУчете(ЭтотОбъект, СтандартнаяОбработка, "Организация");
	
	Если СтандартнаяОбработка Тогда
		Если Не ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизацийЗарплатаКадрыБазовая") 
			И Не ЗначениеЗаполнено(Объект.Организация) Тогда 
			Объект.Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
		КонецЕсли;
	КонецЕсли;
	
	Элементы.ПрикреплениеСотрудниковКомментарий.Видимость = Ложь;
	Элементы.ОткреплениеСотрудниковКомментарий.Видимость = Ложь;
	
	ИспользоватьДополнительныеРеквизитыИСведения = ПолучитьФункциональнуюОпцию("ИспользоватьДополнительныеРеквизитыИСведения");
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.МедицинскоеСтрахованиеКоманднаяПанель;
	ПараметрыРазмещения.Источники = МедицинскоеСтрахование.Отбор.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных("Ссылка")).Тип;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов") Тогда
		МодульУчетОригиналовПервичныхДокументов = ОбщегоНазначения.ОбщийМодуль("УчетОригиналовПервичныхДокументов");
		МодульУчетОригиналовПервичныхДокументов.ПриСозданииНаСервере_ФормаСписка(ЭтотОбъект, Элементы.МедицинскоеСтрахование, Элементы.МедицинскоеСтрахованиеКомментарий);
		МодульУчетОригиналовПервичныхДокументов.УстановитьУсловноеОформлениеВФормеСписка(ЭтотОбъект, Элементы.МедицинскоеСтрахование);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	ПриИзмененииОсновныхПолейНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ПрикреплениеКПрограммамМедицинскогоСтрахования" Тогда
		ПрикреплениеКПрограммамСтрахованияЗаполнить();
	ИначеЕсли ИмяСобытия = "Запись_ОткреплениеОтПрограммМедицинскогоСтрахования" Тогда
		ОткреплениеОтПрограммСтрахованияЗаполнить();
	КонецЕсли;
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов") Тогда
		МодульУчетОригиналовПервичныхДокументовКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УчетОригиналовПервичныхДокументовКлиент");
		МодульУчетОригиналовПервичныхДокументовКлиент.ОбработчикОповещенияФормаСписка(ИмяСобытия, ЭтотОбъект, Элементы.МедицинскоеСтрахование);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ПриИзмененииОсновныхПолейНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СтраховаяКомпанияПриИзменении(Элемент)
	ПриИзмененииОсновныхПолейНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	ПриИзмененииОсновныхПолейНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСотрудниковНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
	ПараметрыОткрытия.Вставить("ТекущаяСтрока", ГруппаСотрудников);
	
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("УсловияСтрахованияСотрудниковЗакрытие", ЭтотОбъект);
	ОткрытьФорму("Справочник.ГруппыСотрудников.ФормаСписка", ПараметрыОткрытия, ЭтотОбъект,,,, ОписаниеОповещенияОЗакрытии);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСотрудниковПриИзменении(Элемент)
	ПриИзмененииОсновныхПолейНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УсловияСтрахованияСотрудниковПриИзменении(Элемент)
	
	Если УсловияСтрахованияСотрудников = 0 Тогда
		ГруппаСотрудников = Неопределено;
		ПриИзмененииОсновныхПолейНаСервере();
	КонецЕсли;
	
	УстановитьДоступностьЭлементов(Элементы, УсловияСтрахованияСотрудников);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПрикреплениеСотрудников

&НаКлиенте
Процедура ПрикреплениеСотрудниковВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Поле.Имя = "ПрикреплениеСотрудниковКоманда" Тогда
		
		ТекущиеДанные = Элемент.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Если ТекущиеДанные.Команда = "Отложить" Тогда
			ТекущиеДанные.ПрикреплениеКПрограммеСтрахованияОтложено = Истина;
			ОтложитьСотрудника(ТекущиеДанные.Сотрудник);
			ТекущиеДанные.Команда = НСтр("ru = 'Возобновить'");
		Иначе
			ТекущиеДанные.ПрикреплениеКПрограммеСтрахованияОтложено = Ложь;
			ВозобновитьСотрудника(ТекущиеДанные.Сотрудник);
			ТекущиеДанные.Команда = НСтр("ru = 'Отложить'");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОткреплениеСотрудников

&НаКлиенте
Процедура ОткреплениеСотрудниковВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Поле.Имя = "ОткреплениеСотрудниковКоманда" Тогда
		
		ТекущиеДанные = Элемент.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Если ТекущиеДанные.Команда = "Отложить" Тогда
			ТекущиеДанные.ОткреплениеОтПрограммыСтрахованияОтложено = Истина;
			ОтложитьСотрудника(ТекущиеДанные.Сотрудник);
			ТекущиеДанные.Команда = НСтр("ru = 'Возобновить'");
		Иначе
			ТекущиеДанные.ОткреплениеОтПрограммыСтрахованияОтложено = Ложь;
			ВозобновитьСотрудника(ТекущиеДанные.Сотрудник);
			ТекущиеДанные.Команда = НСтр("ru = 'Отложить'");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИзменениеПерсональныхДанных

&НаКлиенте
Процедура ИзменениеПерсональныхДанныхВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФормуИзмененияОтправленныхДанных();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыМедицинскоеСтрахование

&НаСервереБезКонтекста
Процедура МедицинскоеСтрахованиеПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов") Тогда
		МодульУчетОригиналовПервичныхДокументов = ОбщегоНазначения.ОбщийМодуль("УчетОригиналовПервичныхДокументов");
		МодульУчетОригиналовПервичныхДокументов.ПриПолученииДанныхНаСервере(Строки);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	
КонецПроцедуры

&НаКлиенте
Процедура МедицинскоеСтрахованиеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов") Тогда
		МодульУчетОригиналовПервичныхДокументовКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УчетОригиналовПервичныхДокументовКлиент");
		МодульУчетОригиналовПервичныхДокументовКлиент.СписокВыбор(Поле.Имя, ЭтотОбъект, Элементы.МедицинскоеСтрахование, СтандартнаяОбработка);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	
КонецПроцедуры

&НаКлиенте
Процедура МедицинскоеСтрахованиеПриАктивизацииСтроки(Элемент)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.МедицинскоеСтрахование);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.МедицинскоеСтрахование, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.МедицинскоеСтрахование);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ПрикреплениеСотрудниковПоказыватьОтложенныхСтрахователей(Команда)
	
	Элементы.ПрикреплениеСотрудниковПоказыватьОтложенныхСтрахователей.Пометка = Не Элементы.ПрикреплениеСотрудниковПоказыватьОтложенныхСтрахователей.Пометка;
	ПоказыватьОтложенныхСтрахователей = Элементы.ПрикреплениеСотрудниковПоказыватьОтложенныхСтрахователей.Пометка;
	УстановитьОтборСтрок(Элементы, "ПрикреплениеСотрудников", "ПрикреплениеКПрограммеСтрахованияОтложено", ПоказыватьОтложенныхСтрахователей);
	Элементы.ПрикреплениеСотрудниковКомментарий.Видимость = Элементы.ПрикреплениеСотрудниковПоказыватьОтложенныхСтрахователей.Пометка;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткреплениеСотрудниковПоказыватьОтложенныхСтрахователей(Команда)
	
	Элементы.ОткреплениеСотрудниковПоказыватьОтложенныхСтрахователей.Пометка = Не Элементы.ОткреплениеСотрудниковПоказыватьОтложенныхСтрахователей.Пометка;
	ПоказыватьОтложенныхСтрахователей = Элементы.ОткреплениеСотрудниковПоказыватьОтложенныхСтрахователей.Пометка;
	УстановитьОтборСтрок(Элементы, "ОткреплениеСотрудников", "ОткреплениеОтПрограммыСтрахованияОтложено", ПоказыватьОтложенныхСтрахователей);
	Элементы.ОткреплениеСотрудниковКомментарий.Видимость = Элементы.ОткреплениеСотрудниковПоказыватьОтложенныхСтрахователей.Пометка;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрикреплениеСотрудниковОбновить(Команда)
	ПрикреплениеКПрограммамСтрахованияЗаполнить();
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПоУмолчанию(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		ПоказатьПредупреждение(, НСтр("ru='Не выбрана организация'"));
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ОрганизацияСсылка", Объект.Организация);
	ПараметрыОткрытия.Вставить("СтраховаяКомпания", Объект.СтраховаяКомпания);
	
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("НастройкиПоУмолчаниюЗакрытие", ЭтотОбъект);
	ОткрытьФорму(МедицинскоеСтрахованиеКлиент.ИмяФормыНастройкиМедицинскогоСтрахования(),
		ПараметрыОткрытия, ЭтотОбъект,,,, ОписаниеОповещенияОЗакрытии, РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрикреплениеСформировать(Команда)
	
	Отказ = ПроверитьНаКлиенте();
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	МассивСотрудников = Новый Массив;
	
	ПараметрыОтбораСтрок = Новый Структура;
	ПараметрыОтбораСтрок.Вставить("ПрикреплениеКПрограммеСтрахованияОтложено", Ложь);
	НайденныеСтроки = Объект.ПрикреплениеСотрудников.НайтиСтроки(ПараметрыОтбораСтрок);
	Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		МассивСотрудников.Добавить(НайденнаяСтрока.Сотрудник);
	КонецЦикла;
	
	ОткрытьПрикреплениеСотрудников(, МассивСотрудников);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткреплениеСформировать(Команда)
	
	Отказ = ПроверитьНаКлиенте();
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	МассивСотрудников = Новый Массив;
	ДатыОткрепления = Новый Соответствие;
	
	ПараметрыОтбораСтрок = Новый Структура;
	ПараметрыОтбораСтрок.Вставить("ОткреплениеОтПрограммыСтрахованияОтложено", Ложь);
	НайденныеСтроки = Объект.ОткреплениеСотрудников.НайтиСтроки(ПараметрыОтбораСтрок);
	Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		МассивСотрудников.Добавить(НайденнаяСтрока.Сотрудник);
		ДатыОткрепления.Вставить(НайденнаяСтрока.Сотрудник, НайденнаяСтрока.ДатаОткрепления);
	КонецЦикла;
	
	ОткрытьОткреплениеСотрудников(, МассивСотрудников, ДатыОткрепления);
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьСтрокуПрикрепления(Команда)
	
	ТекущиеДанные = Элементы.ПрикреплениеСотрудников.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьПрикреплениеСотрудников(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткреплениеСотрудниковОбновить(Команда)
	ОткреплениеОтПрограммСтрахованияЗаполнить();
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеЛичныхДанныхОбновить(Команда)
	ИзмененияПерсональныхДанныхЗаполнить();
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьСтрокуОткрепления(Команда)
	
	ТекущиеДанные = Элементы.ОткреплениеСотрудников.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДатыОткрепления = Новый Соответствие;
	ДатыОткрепления.Вставить(ТекущиеДанные.Сотрудник, ТекущиеДанные.ДатаОткрепления);
	
	ОткрытьОткреплениеСотрудников(ТекущиеДанные, , ДатыОткрепления);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьИзменениеПерсональныхДанных(Команда)
	
	Если Элементы.ИзменениеПерсональныхДанных.ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	МассивЗастрахованных = Новый Массив;
	
	Для Каждого ВыделеннаяСтрока Из Элементы.ИзменениеПерсональныхДанных.ВыделенныеСтроки Цикл
		СтрокаДанных = Объект.ИзменениеПерсональныхДанныхСотрудников.НайтиПоИдентификатору(ВыделеннаяСтрока);
		Если СтрокаДанных = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		МассивЗастрахованных.Добавить(СтрокаДанных.Застрахованный);
	КонецЦикла;
	
	ПараметрыОткрытия = Новый Структура;
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Организация", Объект.Организация);
	ЗначенияЗаполнения.Вставить("СтраховаяКомпания", Объект.СтраховаяКомпания);
	ЗначенияЗаполнения.Вставить("Подразделение", Объект.Подразделение);
	ЗначенияЗаполнения.Вставить("МассивЗастрахованных", МассивЗастрахованных);
	ПараметрыОткрытия.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	ОткрытьФорму("Документ.ИзменениеУсловийМедицинскогоСтрахования.ФормаОбъекта", ПараметрыОткрытия, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ИгнорироватьИзменениеПерсональныхДанных(Команда)
	
	ТекущиеДанные = Элементы.ИзменениеПерсональныхДанных.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИгнорироватьИзменениеПерсональныхДанныхНаСервере(ТекущиеДанные.Застрахованный);
	ИзмененияПерсональныхДанныхЗаполнить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтложитьСотрудниковВПрикреплении(Команда)
	
	Если Элементы.ПрикреплениеСотрудников.ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ОтложитьСотрудниковВПрикрепленииЗавершение", ЭтотОбъект);
	ОткрытьФорму("Обработка.МедицинскоеСтрахование.Форма.КомментарийДляОтложенногоСотрудника", , ЭтотОбъект, , , , Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ВозобновитьСотрудниковВПрикреплении(Команда)
	
	Если Элементы.ПрикреплениеСотрудников.ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивСотрудников = Новый Массив;
	
	Для Каждого ВыделеннаяСтрока Из Элементы.ПрикреплениеСотрудников.ВыделенныеСтроки Цикл
		СтрокаДанных = Объект.ПрикреплениеСотрудников.НайтиПоИдентификатору(ВыделеннаяСтрока);
		Если СтрокаДанных <> Неопределено Тогда
			СтрокаДанных.ПрикреплениеКПрограммеСтрахованияОтложено = Ложь;
			СтрокаДанных.Комментарий = "";
			МассивСотрудников.Добавить(СтрокаДанных.Сотрудник);
		КонецЕсли;
	КонецЦикла;
	
	ВозобновитьСотрудников(МассивСотрудников);
	УстановитьТекстЗаголовкаПрикрепление();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтложитьСотрудниковВОткреплении(Команда)
	
	Если Элементы.ОткреплениеСотрудников.ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ОтложитьСотрудниковВОткрепленииЗавершение", ЭтотОбъект);
	ОткрытьФорму("Обработка.МедицинскоеСтрахование.Форма.КомментарийДляОтложенногоСотрудника", , ЭтотОбъект, , , , Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ВозобновитьСотрудниковВОткреплении(Команда)
	
	Если Элементы.ОткреплениеСотрудников.ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивСотрудников = Новый Массив;
	
	Для Каждого ВыделеннаяСтрока Из Элементы.ОткреплениеСотрудников.ВыделенныеСтроки Цикл
		СтрокаДанных = Объект.ОткреплениеСотрудников.НайтиПоИдентификатору(ВыделеннаяСтрока);
		Если СтрокаДанных <> Неопределено Тогда
			СтрокаДанных.ОткреплениеОтПрограммыСтрахованияОтложено = Ложь;
			СтрокаДанных.Комментарий = "";
			МассивСотрудников.Добавить(СтрокаДанных.Сотрудник);
		КонецЕсли;
	КонецЦикла;
	
	ВозобновитьСотрудников(МассивСотрудников);
	УстановитьТекстЗаголовкаОткрепление();
	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеИзменений(Команда)
	
	ОткрытьФормуИзмененияОтправленныхДанных();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОтложитьСотрудника(Сотрудник)
	
	НаборЗаписей = РегистрыСведений.ОтложенноеМедицинскоеСтрахованиеСотрудников.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Объект.Организация);
	НаборЗаписей.Отбор.СтраховаяКомпания.Установить(Объект.СтраховаяКомпания);
	НаборЗаписей.Отбор.Сотрудник.Установить(Сотрудник);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Организация = Объект.Организация;
	НоваяЗапись.СтраховаяКомпания = Объект.СтраховаяКомпания;
	НоваяЗапись.Сотрудник = Сотрудник;
	НоваяЗапись.ФизическоеЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сотрудник, "ФизическоеЛицо");
	
	НаборЗаписей.Записать();
	
	УстановитьТекстЗаголовкаПрикрепление();
	
КонецПроцедуры

&НаСервере
Процедура ВозобновитьСотрудника(Сотрудник)
	
	НаборЗаписей = РегистрыСведений.ОтложенноеМедицинскоеСтрахованиеСотрудников.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Объект.Организация);
	НаборЗаписей.Отбор.СтраховаяКомпания.Установить(Объект.СтраховаяКомпания);
	НаборЗаписей.Отбор.Сотрудник.Установить(Сотрудник);
	
	НаборЗаписей.Записать();
	
	УстановитьТекстЗаголовкаПрикрепление();
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииОсновныхПолейНаСервере()
	
	МедицинскоеСтрахованиеФормы.ПрикреплениеПрочитатьНастройки(ЭтотОбъект);
	
	ПрикреплениеКПрограммамСтрахованияЗаполнить();
	УстановитьОтборСтрок(Элементы, "ПрикреплениеСотрудников", "ПрикреплениеКПрограммеСтрахованияОтложено", ПоказыватьОтложенныхСтрахователей);
	
	ОткреплениеОтПрограммСтрахованияЗаполнить();
	УстановитьОтборСтрок(Элементы, "ОткреплениеСотрудников", "ОткреплениеОтПрограммыСтрахованияОтложено", ПоказыватьОтложенныхСтрахователей);
	
	ИзмененияПерсональныхДанныхЗаполнить();
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(МедицинскоеСтрахование, "Организация", Объект.Организация,,, ЗначениеЗаполнено(Объект.Организация));
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(МедицинскоеСтрахование, "Подразделение", Объект.Подразделение,,, ЗначениеЗаполнено(Объект.Подразделение));
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(МедицинскоеСтрахование, "СтраховаяКомпания", Объект.СтраховаяКомпания,,, ЗначениеЗаполнено(Объект.СтраховаяКомпания));
	
КонецПроцедуры

&НаСервере
Процедура ПрикреплениеКПрограммамСтрахованияЗаполнить(Сотрудники = Неопределено)
	
	СтруктураИменТаблиц = МедицинскоеСтрахованиеФормы.СтруктураИменТаблиц();
	СтруктураИменТаблиц.ИмяТаблицыСотрудники = "ПрикреплениеСотрудников";
	
	МедицинскоеСтрахованиеФормы.ПрикреплениеКПрограммамСтрахованияЗаполнить(ЭтотОбъект, СтруктураИменТаблиц, Сотрудники, Ложь, Ложь);
	
	УстановитьТекстЗаголовкаПрикрепление();
	УстановитьДоступностьКомандыОтложенныеСотрудникиПрикрепления();
	
КонецПроцедуры

&НаСервере
Процедура ОткреплениеОтПрограммСтрахованияЗаполнить()
	
	Объект.ОткреплениеСотрудников.Очистить();
	
	// Получим сведения по сотрудникам, не прикрепленных к программам страхования
	
	Если Не ЗначениеЗаполнено(Объект.Организация) ИЛИ Не ЗначениеЗаполнено(Объект.СтраховаяКомпания) Тогда
		// Показываем только сводные сведения
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("СтраховаяКомпания", Объект.СтраховаяКомпания);
	Запрос.УстановитьПараметр("ДатаОкончанияСтрахования", Объект.ДатаОкончанияСтрахования);
	Запрос.УстановитьПараметр("ГруппаСотрудников", ГруппаСотрудников);
	Запрос.УстановитьПараметр("ОтборПоГруппеСотрудников", ЗначениеЗаполнено(ГруппаСотрудников));
	
	ПараметрыПолученияСотрудников = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыПолученияСотрудников.Организация = Объект.Организация;
	Если ЗначениеЗаполнено(Объект.Подразделение) Тогда
		ПараметрыПолученияСотрудников.Подразделение = Объект.Подразделение;
	КонецЕсли;
	ПараметрыПолученияСотрудников.НачалоПериода 	= Объект.ДатаНачалаСтрахования;
	ПараметрыПолученияСотрудников.ОкончаниеПериода	= Объект.ДатаОкончанияСтрахования;
	ПараметрыПолученияСотрудников.КадровыеДанные	= "Организация, ДатаУвольнения";
	
	КадровыйУчет.СоздатьВТСотрудникиОрганизации(Запрос.МенеджерВременныхТаблиц, Истина, ПараметрыПолученияСотрудников);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СотрудникиОрганизации.Сотрудник КАК Сотрудник
	|ИЗ
	|	ВТСотрудникиОрганизации КАК СотрудникиОрганизации";
	
	МассивСотрудников = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");
	
	Если ОткреплятьСотрудниковВОтпускеПоУходуЗаРебенком Тогда
		
		Состояния = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Перечисления.СостоянияСотрудника.ОтпускПоУходуЗаРебенком);
		СостоянияСотрудников.СоздатьВТСостоянияСотрудников(
			Запрос.МенеджерВременныхТаблиц, МассивСотрудников, Состояния, Объект.ДатаНачалаСтрахования, Объект.ДатаОкончанияСтрахования);
	Иначе
		
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 0
		|	ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка) КАК Сотрудник,
		|	NULL КАК Начало
		|ПОМЕСТИТЬ ВТСостоянияСотрудников";
		Запрос.Выполнить();
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ГруппаСотрудников) Тогда
		ГруппыСотрудников.СоздатьВТГруппыСотрудников(Запрос.МенеджерВременныхТаблиц, МассивСотрудников);
	Иначе
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	NULL КАК Сотрудник,
		|	NULL КАК ФизическоеЛицо,
		|	NULL КАК Группа
		|ПОМЕСТИТЬ ВТГруппыСотрудников";
		
		Запрос.Выполнить();
		
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Сотрудники.Сотрудник КАК Сотрудник,
	|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
	|	МИНИМУМ(Сотрудники.ДатаОткрепления) КАК ДатаОткрепления,
	|	Сотрудники.ЕстьРешениеОбУвольнении КАК ЕстьРешениеОбУвольнении,
	|	Сотрудники.ДатаУвольнения КАК ДатаУвольнения
	|ПОМЕСТИТЬ ВТОткрепляемыеСотрудники
	|ИЗ
	|	(ВЫБРАТЬ
	|		СотрудникиОрганизации.Сотрудник КАК Сотрудник,
	|		СотрудникиОрганизации.ФизическоеЛицо КАК ФизическоеЛицо,
	|		СотрудникиОрганизации.ДатаУвольнения КАК ДатаОткрепления,
	|		ЛОЖЬ КАК ЕстьРешениеОбУвольнении,
	|		NULL КАК ДатаУвольнения
	|	ИЗ
	|		ВТСотрудникиОрганизации КАК СотрудникиОрганизации
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТГруппыСотрудников КАК ГруппыСотрудников
	|			ПО СотрудникиОрганизации.Сотрудник = ГруппыСотрудников.Сотрудник
	|	ГДЕ
	|		СотрудникиОрганизации.ДатаУвольнения <> ДАТАВРЕМЯ(1, 1, 1)
	|		И (НЕ &ОтборПоГруппеСотрудников
	|				ИЛИ ГруппыСотрудников.Группа = &ГруппаСотрудников)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СостоянияСотрудников.Сотрудник,
	|		СостоянияСотрудников.Сотрудник.ФизическоеЛицо,
	|		СостоянияСотрудников.Начало,
	|		ЛОЖЬ,
	|		NULL
	|	ИЗ
	|		ВТСостоянияСотрудников КАК СостоянияСотрудников
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТГруппыСотрудников КАК ГруппыСотрудников
	|			ПО СостоянияСотрудников.Сотрудник = ГруппыСотрудников.Сотрудник
	|	ГДЕ
	|		(НЕ &ОтборПоГруппеСотрудников
	|				ИЛИ ГруппыСотрудников.Группа = &ГруппаСотрудников)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВсеСотрудники.Сотрудник,
	|		ВсеСотрудники.ФизическоеЛицо,
	|		РешенияОбОткрепленииСотрудниковМедицинскогоСтрахования.ДатаОткрепления,
	|		ИСТИНА,
	|		РешенияОбОткрепленииСотрудниковМедицинскогоСтрахования.Регистратор.ДатаУвольнения
	|	ИЗ
	|		(ВЫБРАТЬ
	|			СотрудникиОрганизации.Сотрудник КАК Сотрудник,
	|			СотрудникиОрганизации.ФизическоеЛицо КАК ФизическоеЛицо
	|		ИЗ
	|			ВТСотрудникиОрганизации КАК СотрудникиОрганизации
	|				ЛЕВОЕ СОЕДИНЕНИЕ ВТГруппыСотрудников КАК ГруппыСотрудников
	|				ПО СотрудникиОрганизации.Сотрудник = ГруппыСотрудников.Сотрудник
	|		ГДЕ
	|			(НЕ &ОтборПоГруппеСотрудников
	|					ИЛИ ГруппыСотрудников.Группа = &ГруппаСотрудников)) КАК ВсеСотрудники
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РешенияОбОткрепленииСотрудниковМедицинскогоСтрахования КАК РешенияОбОткрепленииСотрудниковМедицинскогоСтрахования
	|			ПО ВсеСотрудники.ФизическоеЛицо = РешенияОбОткрепленииСотрудниковМедицинскогоСтрахования.ФизическоеЛицо
	|				И (РешенияОбОткрепленииСотрудниковМедицинскогоСтрахования.Организация = &Организация)
	|	ГДЕ
	|		РешенияОбОткрепленииСотрудниковМедицинскогоСтрахования.ФизическоеЛицо ЕСТЬ НЕ NULL 
	|		И РешенияОбОткрепленииСотрудниковМедицинскогоСтрахования.ДатаОткрепления <= &ДатаОкончанияСтрахования
	|		И РешенияОбОткрепленииСотрудниковМедицинскогоСтрахования.Откреплять = ИСТИНА) КАК Сотрудники
	|
	|СГРУППИРОВАТЬ ПО
	|	Сотрудники.Сотрудник,
	|	Сотрудники.ФизическоеЛицо,
	|	Сотрудники.ЕстьРешениеОбУвольнении,
	|	Сотрудники.ДатаУвольнения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СотрудникиНеПрикрепленные.Сотрудник КАК Сотрудник,
	|	ОтложенноеМедицинскоеСтрахованиеСотрудников.Комментарий КАК Комментарий
	|ПОМЕСТИТЬ ВТОтложенныеСотрудники
	|ИЗ
	|	ВТОткрепляемыеСотрудники КАК СотрудникиНеПрикрепленные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтложенноеМедицинскоеСтрахованиеСотрудников КАК ОтложенноеМедицинскоеСтрахованиеСотрудников
	|		ПО СотрудникиНеПрикрепленные.Сотрудник = ОтложенноеМедицинскоеСтрахованиеСотрудников.Сотрудник
	|			И (ОтложенноеМедицинскоеСтрахованиеСотрудников.Организация = &Организация)
	|			И (ОтложенноеМедицинскоеСтрахованиеСотрудников.СтраховаяКомпания = &СтраховаяКомпания)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПрограммыМедицинскогоСтрахованияСотрудников.Организация КАК Организация,
	|	СотрудникиОрганизации.Сотрудник КАК Сотрудник,
	|	ПрограммыМедицинскогоСтрахованияСотрудников.ФизическоеЛицо КАК ФизическоеЛицо,
	|	МАКСИМУМ(ПрограммыМедицинскогоСтрахованияСотрудников.Период) КАК Период
	|ПОМЕСТИТЬ ВТМаксимальныеПериодыПрограммСтрахования
	|ИЗ
	|	ВТОткрепляемыеСотрудники КАК СотрудникиОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПрограммыМедицинскогоСтрахованияСотрудников КАК ПрограммыМедицинскогоСтрахованияСотрудников
	|		ПО (ПрограммыМедицинскогоСтрахованияСотрудников.Организация = &Организация)
	|			И СотрудникиОрганизации.ФизическоеЛицо = ПрограммыМедицинскогоСтрахованияСотрудников.ФизическоеЛицо
	|ГДЕ
	|	ПрограммыМедицинскогоСтрахованияСотрудников.Период <= &ДатаОкончанияСтрахования
	|
	|СГРУППИРОВАТЬ ПО
	|	ПрограммыМедицинскогоСтрахованияСотрудников.Организация,
	|	СотрудникиОрганизации.Сотрудник,
	|	ПрограммыМедицинскогоСтрахованияСотрудников.ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасширенияПрограммМедицинскогоСтрахованияСотрудников.Организация КАК Организация,
	|	СотрудникиОрганизации.Сотрудник КАК Сотрудник,
	|	РасширенияПрограммМедицинскогоСтрахованияСотрудников.ФизическоеЛицо КАК ФизическоеЛицо,
	|	МАКСИМУМ(РасширенияПрограммМедицинскогоСтрахованияСотрудников.Период) КАК Период
	|ПОМЕСТИТЬ ВТМаксимальныеПериодыРасширенийСтрахования
	|ИЗ
	|	ВТОткрепляемыеСотрудники КАК СотрудникиОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РасширенияПрограммМедицинскогоСтрахованияСотрудников КАК РасширенияПрограммМедицинскогоСтрахованияСотрудников
	|		ПО (РасширенияПрограммМедицинскогоСтрахованияСотрудников.Организация = &Организация)
	|			И СотрудникиОрганизации.ФизическоеЛицо = РасширенияПрограммМедицинскогоСтрахованияСотрудников.ФизическоеЛицо
	|ГДЕ
	|	РасширенияПрограммМедицинскогоСтрахованияСотрудников.Период <= &ДатаОкончанияСтрахования
	|
	|СГРУППИРОВАТЬ ПО
	|	РасширенияПрограммМедицинскогоСтрахованияСотрудников.Организация,
	|	СотрудникиОрганизации.Сотрудник,
	|	РасширенияПрограммМедицинскогоСтрахованияСотрудников.ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СотрудникиОрганизации.Сотрудник КАК Сотрудник,
	|	СотрудникиОрганизации.ДатаОткрепления КАК ДатаОткрепления,
	|	СотрудникиОрганизации.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА ОтложенныеСотрудники.Сотрудник ЕСТЬ НЕ NULL 
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОтложенныйСотрудник,
	|	СотрудникиОрганизации.ЕстьРешениеОбУвольнении КАК ЕстьРешениеОбУвольнении,
	|	СотрудникиОрганизации.ДатаУвольнения КАК ДатаУвольнения,
	|	ОтложенныеСотрудники.Комментарий КАК Комментарий
	|ИЗ
	|	ВТОткрепляемыеСотрудники КАК СотрудникиОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрограммыМедицинскогоСтрахованияСотрудников КАК ПрограммыМедицинскогоСтрахованияСотрудников
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТМаксимальныеПериодыПрограммСтрахования КАК МаксимальныеПериодыПрограммСтрахования
	|			ПО ПрограммыМедицинскогоСтрахованияСотрудников.Период = МаксимальныеПериодыПрограммСтрахования.Период
	|				И ПрограммыМедицинскогоСтрахованияСотрудников.ФизическоеЛицо = МаксимальныеПериодыПрограммСтрахования.ФизическоеЛицо
	|				И ПрограммыМедицинскогоСтрахованияСотрудников.Организация = МаксимальныеПериодыПрограммСтрахования.Организация
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрограммыМедицинскогоСтрахованияСотрудников КАК ПрограммыМедицинскогоСтрахованияСотрудниковУвольнение
	|			ПО (ПрограммыМедицинскогоСтрахованияСотрудников.Организация = &Организация)
	|				И ПрограммыМедицинскогоСтрахованияСотрудников.ФизическоеЛицо = ПрограммыМедицинскогоСтрахованияСотрудниковУвольнение.ФизическоеЛицо
	|				И ПрограммыМедицинскогоСтрахованияСотрудников.Период = ПрограммыМедицинскогоСтрахованияСотрудниковУвольнение.Период
	|				И (ПрограммыМедицинскогоСтрахованияСотрудниковУвольнение.Регистратор ССЫЛКА Документ.ОткреплениеОтПрограммМедицинскогоСтрахования)
	|		ПО (ПрограммыМедицинскогоСтрахованияСотрудников.Организация = &Организация)
	|			И СотрудникиОрганизации.ФизическоеЛицо = ПрограммыМедицинскогоСтрахованияСотрудников.ФизическоеЛицо
	|			И СотрудникиОрганизации.ДатаОткрепления > ПрограммыМедицинскогоСтрахованияСотрудников.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РасширенияПрограммМедицинскогоСтрахованияСотрудников КАК РасширенияПрограммМедицинскогоСтрахованияСотрудников
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТМаксимальныеПериодыРасширенийСтрахования КАК МаксимальныеПериодыРасширенийСтрахования
	|			ПО РасширенияПрограммМедицинскогоСтрахованияСотрудников.Период = МаксимальныеПериодыРасширенийСтрахования.Период
	|				И РасширенияПрограммМедицинскогоСтрахованияСотрудников.ФизическоеЛицо = МаксимальныеПериодыРасширенийСтрахования.ФизическоеЛицо
	|				И РасширенияПрограммМедицинскогоСтрахованияСотрудников.Организация = МаксимальныеПериодыРасширенийСтрахования.Организация
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РасширенияПрограммМедицинскогоСтрахованияСотрудников КАК РасширенияПрограммМедицинскогоСтрахованияСотрудниковУвольнение
	|			ПО (РасширенияПрограммМедицинскогоСтрахованияСотрудников.Организация = &Организация)
	|				И РасширенияПрограммМедицинскогоСтрахованияСотрудников.ФизическоеЛицо = РасширенияПрограммМедицинскогоСтрахованияСотрудниковУвольнение.ФизическоеЛицо
	|				И РасширенияПрограммМедицинскогоСтрахованияСотрудников.Период = РасширенияПрограммМедицинскогоСтрахованияСотрудниковУвольнение.Период
	|				И (РасширенияПрограммМедицинскогоСтрахованияСотрудниковУвольнение.Регистратор ССЫЛКА Документ.ОткреплениеОтПрограммМедицинскогоСтрахования)
	|		ПО (РасширенияПрограммМедицинскогоСтрахованияСотрудников.Организация = &Организация)
	|			И СотрудникиОрганизации.ФизическоеЛицо = РасширенияПрограммМедицинскогоСтрахованияСотрудников.ФизическоеЛицо
	|			И СотрудникиОрганизации.ДатаОткрепления > РасширенияПрограммМедицинскогоСтрахованияСотрудников.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОтложенныеСотрудники КАК ОтложенныеСотрудники
	|		ПО СотрудникиОрганизации.Сотрудник = ОтложенныеСотрудники.Сотрудник
	|ГДЕ
	|	(ПрограммыМедицинскогоСтрахованияСотрудников.ФизическоеЛицо ЕСТЬ НЕ NULL 
	|				И ПрограммыМедицинскогоСтрахованияСотрудниковУвольнение.ФизическоеЛицо ЕСТЬ NULL
	|			ИЛИ РасширенияПрограммМедицинскогоСтрахованияСотрудников.ФизическоеЛицо ЕСТЬ НЕ NULL 
	|				И РасширенияПрограммМедицинскогоСтрахованияСотрудниковУвольнение.ФизическоеЛицо ЕСТЬ NULL)
	|
	|УПОРЯДОЧИТЬ ПО
	|	СотрудникиОрганизации.Сотрудник";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("Сотрудник") Цикл
		НоваяСтрока = Объект.ОткреплениеСотрудников.Добавить();
		НоваяСтрока.Сотрудник = Выборка.Сотрудник;
		НоваяСтрока.ДатаОткрепления = Выборка.ДатаОткрепления;
		НоваяСтрока.Комментарий = Выборка.Комментарий;
		НоваяСтрока.ОткреплениеОтПрограммыСтрахованияОтложено = Выборка.ОтложенныйСотрудник;
		НоваяСтрока.Команда = ?(Выборка.ОтложенныйСотрудник, НСтр("ru = 'Возобновить'"), НСтр("ru = 'Отложить'"));
		Если Выборка.ЕстьРешениеОбУвольнении Тогда
			НоваяСтрока.Основание = СтрШаблон(НСтр("ru = 'Решение об увольнении %1, открепление %2'"),
				Формат(Выборка.ДатаУвольнения, "ДЛФ=Д"),
				Формат(Выборка.ДатаОткрепления, "ДЛФ=Д"));
		Иначе
			НоваяСтрока.Основание = СтрШаблон(НСтр("ru = 'Увольнение  %1'"),
				Формат(Выборка.ДатаОткрепления, "ДЛФ=Д"));
		КонецЕсли;
	КонецЦикла;
	
	Объект.ОткреплениеСотрудников.Сортировать("Сотрудник");
	
	УстановитьТекстЗаголовкаОткрепление();
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьНаКлиенте()
	
	Отказ = Ложь;
	Если Не ЗначениеЗаполнено(Объект.ДатаНачалаСтрахования) Или Не ЗначениеЗаполнено(Объект.ДатаОкончанияСтрахования) Тогда
		ТекстОшибки = НСтр("ru = 'Не указан период страхования.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , , , Отказ);
	КонецЕсли;
	
	Возврат Отказ;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборСтрок(Элементы, ИмяТаблицы, ИмяСвойства, ПоказыватьОтложенныхСтрахователей)
	
	СтруктураОтбора = ?(ПоказыватьОтложенныхСтрахователей, Неопределено, Новый ФиксированнаяСтруктура(ИмяСвойства, Ложь));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, ИмяТаблицы, "ОтборСтрок", СтруктураОтбора);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТекстЗаголовкаПрикрепление()
	
	ТекстЗаголовка = НСтр("ru = 'Прикрепление к программам'");
	СтруктураОтбора = Новый Структура("ПрикреплениеКПрограммеСтрахованияОтложено", Ложь);
	НайденныеСтроки = Объект.ПрикреплениеСотрудников.НайтиСтроки(СтруктураОтбора);
	КоличествоСотрудников = НайденныеСтроки.Количество();
	Если КоличествоСотрудников > 0 Тогда
		ТекстЗаголовка = ТекстЗаголовка + " (" + КоличествоСотрудников + ")";
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаПрикреплениеКПрограммамСтрахования", "Заголовок", ТекстЗаголовка);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьКомандыОтложенныеСотрудникиПрикрепления()
	
	СтруктураОтбора = Новый Структура("ПрикреплениеКПрограммеСтрахованияОтложено", Истина);
	НайденныеСтроки = Объект.ПрикреплениеСотрудников.НайтиСтроки(СтруктураОтбора);
	ЕстьОтложенныеСотрудникиВПрикреплении = ?(НайденныеСтроки.Количество() > 0, Истина, Ложь);
	Элементы.ПрикреплениеСотрудниковПоказыватьОтложенныхСтрахователей.Видимость = ЕстьОтложенныеСотрудникиВПрикреплении;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьКомандыОтложенныеСотрудникиОткрепления()
	
	СтруктураОтбора = Новый Структура("ОткреплениеОтПрограммыСтрахованияОтложено", Истина);
	НайденныеСтроки = Объект.ОткреплениеСотрудников.НайтиСтроки(СтруктураОтбора);
	ЕстьОтложенныеСотрудникиВОткреплении = ?(НайденныеСтроки.Количество() > 0, Истина, Ложь);
	Элементы.ОткреплениеСотрудниковПоказыватьОтложенныхСтрахователей.Видимость = ЕстьОтложенныеСотрудникиВОткреплении;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТекстЗаголовкаОткрепление()
	
	ТекстЗаголовка = НСтр("ru = 'Открепление от программ'");
	СтруктураОтбора = Новый Структура("ОткреплениеОтПрограммыСтрахованияОтложено", Ложь);
	НайденныеСтроки = Объект.ОткреплениеСотрудников.НайтиСтроки(СтруктураОтбора);
	КоличествоСотрудников = НайденныеСтроки.Количество();
	Если КоличествоСотрудников > 0 Тогда
		ТекстЗаголовка = ТекстЗаголовка + " (" + КоличествоСотрудников + ")";
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаОткрепление", "Заголовок", ТекстЗаголовка);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПоУмолчаниюЗакрытие(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Отмена Тогда
		ПриИзмененииОсновныхПолейНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПрикреплениеСотрудников(ДанныеСтроки = Неопределено, Сотрудники = Неопределено)
	
	ПараметрыОткрытия = Новый Структура;
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Организация", Объект.Организация);
	ЗначенияЗаполнения.Вставить("СтраховаяКомпания", Объект.СтраховаяКомпания);
	ЗначенияЗаполнения.Вставить("Подразделение", Объект.Подразделение);
	Если Сотрудники = Неопределено Тогда
		Если ДанныеСтроки <> Неопределено Тогда
			ЗначенияЗаполнения.Вставить("Сотрудники", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеСтроки.Сотрудник));
		Иначе
			ЗначенияЗаполнения.Вставить("Сотрудники", Новый Массив);
		КонецЕсли;
	Иначе
		ЗначенияЗаполнения.Вставить("Сотрудники", Сотрудники);
	КонецЕсли;
	ПараметрыОткрытия.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОткрытьФорму("Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.ФормаОбъекта", ПараметрыОткрытия, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОткреплениеСотрудников(ДанныеСтроки = Неопределено, Сотрудники = Неопределено, ДатыОткрепления = Неопределено)
	
	ПараметрыОткрытия = Новый Структура;
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Организация", Объект.Организация);
	ЗначенияЗаполнения.Вставить("СтраховаяКомпания", Объект.СтраховаяКомпания);
	ЗначенияЗаполнения.Вставить("Подразделение", Объект.Подразделение);
	Если Сотрудники = Неопределено Тогда
		Если ДанныеСтроки <> Неопределено Тогда
			ЗначенияЗаполнения.Вставить("Сотрудники", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеСтроки.Сотрудник));
			ЗначенияЗаполнения.Вставить("ДатыОткрепления", ДатыОткрепления);
		Иначе
			ЗначенияЗаполнения.Вставить("Сотрудники", Новый Массив);
		КонецЕсли;
	Иначе
		ЗначенияЗаполнения.Вставить("Сотрудники", Сотрудники);
		ЗначенияЗаполнения.Вставить("ДатыОткрепления", ДатыОткрепления);
	КонецЕсли;
	ПараметрыОткрытия.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОткрытьФорму("Документ.ОткреплениеОтПрограммМедицинскогоСтрахования.ФормаОбъекта", ПараметрыОткрытия, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура УсловияСтрахованияСотрудниковЗакрытие(Результат, ДополнительныеПараметры) Экспорт
	
	ГруппаСотрудников = Результат;
	ПриИзмененииОсновныхПолейНаСервере();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьЭлементов(Элементы, УсловияСтрахованияСотрудников)
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаСотрудников", "Доступность", УсловияСтрахованияСотрудников <> 0);
КонецПроцедуры

&НаСервере
Процедура ИгнорироватьИзменениеПерсональныхДанныхНаСервере(Застрахованный)
	
	НаборЗаписей = РегистрыСведений.ИзменениеОтправленныхДанныхЗастрахованных.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Объект.Организация);
	НаборЗаписей.Отбор.СтраховаяКомпания.Установить(Объект.СтраховаяКомпания);
	НаборЗаписей.Отбор.Застрахованный.Установить(Застрахованный);
	НаборЗаписей.Записать();
	
	НаборЗаписей = РегистрыСведений.ИзменениеОтправленнойКонтактнойИнформацииЗастрахованных.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Объект.Организация);
	НаборЗаписей.Отбор.СтраховаяКомпания.Установить(Объект.СтраховаяКомпания);
	НаборЗаписей.Отбор.Застрахованный.Установить(Застрахованный);
	НаборЗаписей.Записать();
	
	Если ИспользоватьДополнительныеРеквизитыИСведения Тогда
		НаборЗаписей = РегистрыСведений.ИзменениеОтправленныхДополнительныхРеквизитовИСведенийЗастрахованных.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Организация.Установить(Объект.Организация);
		НаборЗаписей.Отбор.СтраховаяКомпания.Установить(Объект.СтраховаяКомпания);
		НаборЗаписей.Отбор.Застрахованный.Установить(Застрахованный);
		НаборЗаписей.Записать();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИзмененияПерсональныхДанныхЗаполнить()
	
	Объект.ИзменениеПерсональныхДанныхСотрудников.Очистить();
	
	Если Не ЗначениеЗаполнено(Объект.Организация) ИЛИ Не ЗначениеЗаполнено(Объект.СтраховаяКомпания) Тогда
		КоличествоЗастрахованныхСИзменениями = "";
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИзменениеОтправленныхДанныхЗастрахованных.Застрахованный КАК Застрахованный,
		|	ИСТИНА КАК ИзменилисьДанные,
		|	ЛОЖЬ КАК ИзменилисьКонтакты,
		|	ЛОЖЬ КАК ИзменилисьДопРеквизиты
		|ПОМЕСТИТЬ ВТИзменения
		|ИЗ
		|	РегистрСведений.ИзменениеОтправленныхДанныхЗастрахованных КАК ИзменениеОтправленныхДанныхЗастрахованных
		|ГДЕ
		|	ИзменениеОтправленныхДанныхЗастрахованных.Организация = &Организация
		|	И ИзменениеОтправленныхДанныхЗастрахованных.СтраховаяКомпания = &СтраховаяКомпания
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИзменениеОтправленнойКонтактнойИнформацииЗастрахованных.Застрахованный,
		|	ЛОЖЬ,
		|	ИСТИНА,
		|	ЛОЖЬ
		|ИЗ
		|	РегистрСведений.ИзменениеОтправленнойКонтактнойИнформацииЗастрахованных КАК ИзменениеОтправленнойКонтактнойИнформацииЗастрахованных
		|ГДЕ
		|	ИзменениеОтправленнойКонтактнойИнформацииЗастрахованных.Организация = &Организация
		|	И ИзменениеОтправленнойКонтактнойИнформацииЗастрахованных.СтраховаяКомпания = &СтраховаяКомпания
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИзменениеОтправленныхДополнительныхРеквизитовИСведенийЗастрахованных.Застрахованный,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ИСТИНА
		|ИЗ
		|	РегистрСведений.ИзменениеОтправленныхДополнительныхРеквизитовИСведенийЗастрахованных КАК ИзменениеОтправленныхДополнительныхРеквизитовИСведенийЗастрахованных
		|ГДЕ
		|	ИзменениеОтправленныхДополнительныхРеквизитовИСведенийЗастрахованных.Организация = &Организация
		|	И ИзменениеОтправленныхДополнительныхРеквизитовИСведенийЗастрахованных.СтраховаяКомпания = &СтраховаяКомпания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТИзменения.Застрахованный КАК Застрахованный,
		|	МАКСИМУМ(ВТИзменения.ИзменилисьДанные) КАК ИзменилисьДанные,
		|	МАКСИМУМ(ВТИзменения.ИзменилисьКонтакты) КАК ИзменилисьКонтакты,
		|	МАКСИМУМ(ВТИзменения.ИзменилисьДопРеквизиты) КАК ИзменилисьДопРеквизиты
		|ИЗ
		|	ВТИзменения КАК ВТИзменения
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТИзменения.Застрахованный";
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("СтраховаяКомпания", Объект.СтраховаяКомпания);
	ЗастрахованныеСИзменениямиДанных = Запрос.Выполнить().Выгрузить();
	КоличествоЗастрахованныхСИзменениями = ЗастрахованныеСИзменениямиДанных.Количество();
	Для Каждого СтрокаЗастрахованный Из ЗастрахованныеСИзменениямиДанных Цикл
		НоваяСтрока = Объект.ИзменениеПерсональныхДанныхСотрудников.Добавить();
		НоваяСтрока.Застрахованный = СтрокаЗастрахованный.Застрахованный;
		НоваяСтрока.Описание = ТекстОписаниеИзменений(СтрокаЗастрахованный.ИзменилисьДанные,
			СтрокаЗастрахованный.ИзменилисьКонтакты,
			СтрокаЗастрахованный.ИзменилисьДопРеквизиты);
		КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ТекстОписаниеИзменений(ИзменилисьДанные, ИзменилисьКонтакты, ИзменилисьДопРеквизиты)
	
	ТекстИзменилисьДанные = ?(ИзменилисьДанные,
		НСтр("ru = 'кадровые данные'"),
		"");
	ТекстИзменилисьКонтакты = ?(ИзменилисьКонтакты,
		НСтр("ru = 'контактная информация'"),
		"");
	ТекстИзменилисьДопРеквизиты = ?(ИзменилисьДопРеквизиты,
		НСтр("ru = 'дополнительные реквизиты и сведения'"),
		"");
	РазделительДанныеИКонтакты = ?(ИзменилисьДанные И ИзменилисьКонтакты,
		НСтр("ru = ', '"),
		"");
	РазделительКонтактыИДопРеквизиты = ?(ИзменилисьКонтакты И ИзменилисьДопРеквизиты,
		НСтр("ru = ', '"),
		"");
		
	Описание = СтрШаблон("%1%2%3%4%5",
		ТекстИзменилисьДанные,
		РазделительДанныеИКонтакты,
		ТекстИзменилисьКонтакты,
		РазделительКонтактыИДопРеквизиты,
		ТекстИзменилисьДопРеквизиты);
	Возврат Врег(Лев(Описание,1)) + Нрег(Сред(Описание,2));
	
КонецФункции

&НаКлиенте
Процедура ОтложитьСотрудниковВПрикрепленииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивСотрудников = Новый Массив;
	
	Для Каждого ВыделеннаяСтрока Из Элементы.ПрикреплениеСотрудников.ВыделенныеСтроки Цикл
		СтрокаДанных = Объект.ПрикреплениеСотрудников.НайтиПоИдентификатору(ВыделеннаяСтрока);
		Если СтрокаДанных <> Неопределено Тогда
			СтрокаДанных.ПрикреплениеКПрограммеСтрахованияОтложено = Истина;
			СтрокаДанных.Комментарий = Результат;
			МассивСотрудников.Добавить(СтрокаДанных.Сотрудник);
		КонецЕсли;
	КонецЦикла;
	
	ОтложитьСотрудников(МассивСотрудников, Результат);
	УстановитьТекстЗаголовкаПрикрепление();
	УстановитьДоступностьКомандыОтложенныеСотрудникиПрикрепления();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтложитьСотрудниковВОткрепленииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивСотрудников = Новый Массив;
	
	Для Каждого ВыделеннаяСтрока Из Элементы.ОткреплениеСотрудников.ВыделенныеСтроки Цикл
		СтрокаДанных = Объект.ОткреплениеСотрудников.НайтиПоИдентификатору(ВыделеннаяСтрока);
		Если СтрокаДанных <> Неопределено Тогда
			СтрокаДанных.ОткреплениеОтПрограммыСтрахованияОтложено = Истина;
			СтрокаДанных.Комментарий = Результат;
			МассивСотрудников.Добавить(СтрокаДанных.Сотрудник);
		КонецЕсли;
	КонецЦикла;
	
	ОтложитьСотрудников(МассивСотрудников, Результат);
	УстановитьТекстЗаголовкаОткрепление();
	УстановитьДоступностьКомандыОтложенныеСотрудникиОткрепления();
	
КонецПроцедуры

&НаСервере
Процедура ОтложитьСотрудников(Сотрудники, Комментарий)
	
	Для Каждого Сотрудник Из Сотрудники Цикл
		НаборЗаписей = РегистрыСведений.ОтложенноеМедицинскоеСтрахованиеСотрудников.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Организация.Установить(Объект.Организация);
		НаборЗаписей.Отбор.СтраховаяКомпания.Установить(Объект.СтраховаяКомпания);
		НаборЗаписей.Отбор.Сотрудник.Установить(Сотрудник);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Организация = Объект.Организация;
		НоваяЗапись.СтраховаяКомпания = Объект.СтраховаяКомпания;
		НоваяЗапись.Сотрудник = Сотрудник;
		НоваяЗапись.ФизическоеЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сотрудник, "ФизическоеЛицо");
		НоваяЗапись.Комментарий = Комментарий;
		
		НаборЗаписей.Записать();
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ВозобновитьСотрудников(Сотрудники)
	
	Для Каждого Сотрудник Из Сотрудники Цикл
		НаборЗаписей = РегистрыСведений.ОтложенноеМедицинскоеСтрахованиеСотрудников.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Организация.Установить(Объект.Организация);
		НаборЗаписей.Отбор.СтраховаяКомпания.Установить(Объект.СтраховаяКомпания);
		НаборЗаписей.Отбор.Сотрудник.Установить(Сотрудник);
		
		НаборЗаписей.Записать();
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуИзмененияОтправленныхДанных()
	
	ТекущиеДанные = Элементы.ИзменениеПерсональныхДанных.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыИзменений = Новый Структура;
	ПараметрыИзменений.Вставить("Организация", Объект.Организация);
	ПараметрыИзменений.Вставить("СтраховаяКомпания", Объект.СтраховаяКомпания);
	ПараметрыИзменений.Вставить("Застрахованный", ТекущиеДанные.Застрахованный);
	
	ОткрытьФорму("Обработка.МедицинскоеСтрахование.Форма.ИзменениеОтправленныхДанных", ПараметрыИзменений);
	
КонецПроцедуры

// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
&НаКлиенте
Процедура Подключаемый_ОбновитьКомандыСостоянияОригинала()
	
	ОбновитьКомандыСостоянияОригинала()
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКомандыСостоянияОригинала()
	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

//Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов

#КонецОбласти
